InformationRegisters/ЦветаЭтапов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦветаЭтапов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СократитьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НаименованиеЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омДиаграммаГантаСерверПовтор/Ext/Module.bsl
Функция ПолучитьЦветаИзБД() Экспорт

	тзЦвета = Новый ТаблицаЗначений;
	тзЦвета.Колонки.Добавить("НаименованиеЭтапа", 		Новый ОписаниеТипов("Строка"));
	тзЦвета.Колонки.Добавить("ЭтоГруппа", 				Новый ОписаниеТипов("Булево"));
	тзЦвета.Колонки.Добавить("СократитьНаименование", 	Новый ОписаниеТипов("Булево"));
	тзЦвета.Колонки.Добавить("Цвет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦветаЭтапов.НаименованиеЭтапа КАК НаименованиеЭтапа,
		|	ЦветаЭтапов.ЭтоГруппа КАК ЭтоГруппа,
		|	ЦветаЭтапов.СократитьНаименование КАК СократитьНаименование,
		|	ЦветаЭтапов.Цвет КАК КодЦвета
		|ИЗ
		|	РегистрСведений.ЦветаЭтапов КАК ЦветаЭтапов";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НС = тзЦвета.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		
		НС.Цвет = омЦветНаСервере.ПолучитьЦветИзСтрокиСПрефиксом(Выборка.КодЦвета);
		
	КонецЦикла;
	
	Возврат тзЦвета;
	
КонецФункции // ПолучитьЦветаИзБД() 

Процедура ЗаписатьЦветВБазу(НаименованиеЭтапа, ЭтоГруппа, СократитьНаименование, Цвет) Экспорт

	МенеджерЗаписи = РегистрыСведений.ЦветаЭтапов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НаименованиеЭтапа = НаименованиеЭтапа;
	МенеджерЗаписи.ЭтоГруппа = ЭтоГруппа;
	МенеджерЗаписи.СократитьНаименование = СократитьНаименование;
	МенеджерЗаписи.Цвет = омЦветНаСервере.ПолучитьСтроковоеПредставлениеЦвета(Цвет);
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры 

Процедура КонтрольЗаписиВРегистре(НаименованиеЭтапа, Цвет, ЭтоГруппа, СократитьНаименование)

	МенеджерЗаписи = РегистрыСведений.ЦветаЭтапов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НаименованиеЭтапа = НаименованиеЭтапа;
	МенеджерЗаписи.Прочитать();
	
	Если ЗначениеЗаполнено(МенеджерЗаписи.НаименованиеЭтапа) Тогда
		Возврат;	
	КонецЕсли;
	
	МенеджерЗаписи.НаименованиеЭтапа = НаименованиеЭтапа;
	МенеджерЗаписи.ЭтоГруппа = ЭтоГруппа;
	МенеджерЗаписи.СократитьНаименование = СократитьНаименование;
	МенеджерЗаписи.Цвет = омЦветНаСервере.ПолучитьСтроковоеПредставлениеЦвета(Цвет); 
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры


Функция НачальноеЗаполнениеЦвета() Экспорт

	КонтрольЗаписиВРегистре("ТЗ", 					WebЦвета.Бирюзовый, 					Ложь, 	Истина);
	КонтрольЗаписиВРегистре("ПКД", 					WebЦвета.СероСиний, 					Ложь, 	Истина);
	КонтрольЗаписиВРегистре("РКД", 					WebЦвета.СинийСоСтальнымОттенком, 		Ложь, 	Истина);
	КонтрольЗаписиВРегистре("Производство", 		WebЦвета.СероСиний, 					Ложь, 	Истина);
	КонтрольЗаписиВРегистре("Монтаж", 				WebЦвета.ЦветМорскойВолныНейтральный, 	Ложь,	Истина);
	КонтрольЗаписиВРегистре("Монтаж", 				WebЦвета.Зеленый, 						Истина,	Истина);
	КонтрольЗаписиВРегистре("Проект", 				WebЦвета.Бежевый, 						Ложь,	Истина);
	КонтрольЗаписиВРегистре("КрайняяДата",			WebЦвета.Черный, 						Ложь,	Истина);
	КонтрольЗаписиВРегистре("Столярка",				WebЦвета.НейтральноПурпурный,			Ложь,	Истина);
	КонтрольЗаписиВРегистре("Малярка", 				WebЦвета.БледноЗолотистый, 				Ложь,	Истина);
	КонтрольЗаписиВРегистре("Подрядчик",			WebЦвета.СветлоНебесноГолубой,			Ложь,	Истина);
	КонтрольЗаписиВРегистре("Исполнитель",			WebЦвета.НейтральноЗеленый,				Ложь,	Истина);
	КонтрольЗаписиВРегистре("Пересечение",			WebЦвета.ЗеленоватоЖелтый,				Ложь,	Истина);
	КонтрольЗаписиВРегистре("Подрядчик",			WebЦвета.СветлоНебесноГолубой,			Ложь,	Истина);
	КонтрольЗаписиВРегистре("Композиция",			WebЦвета.ЗеленыйЛес,					Ложь,	Истина);
	КонтрольЗаписиВРегистре("КомпозицияЭлемент",	WebЦвета.СветлоЗеленый,					Ложь,	Истина);
	КонтрольЗаписиВРегистре("Конструирование",		WebЦвета.ТемноОранжевый,				Ложь,	Истина);
	КонтрольЗаписиВРегистре("Конструирование",		WebЦвета.РыжеватоКоричневый,			Истина,	Истина);
	КонтрольЗаписиВРегистре("Согласования",			WebЦвета.Серый,							Ложь,	Истина);
	КонтрольЗаписиВРегистре("Согласования",			WebЦвета.Серый,							Истина,	Истина);
	КонтрольЗаписиВРегистре("Помещение",			WebЦвета.БледноЗолотистый,				Ложь,	Истина);
	КонтрольЗаписиВРегистре("ПланКонструирование",	WebЦвета.Васильковый,					Ложь,	Истина);
	КонтрольЗаписиВРегистре("Пауза",				WebЦвета.СветлоКоралловый,				Ложь,	Истина);
	КонтрольЗаписиВРегистре("ЗадачаПросрочена",		WebЦвета.Красный,						Ложь,	Истина);

КонецФункции // НачальноеЗаполнениеЦвета()
